docs/elisp-excercise/2024-07-28-T10-emacs-lisp-idioms.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-30 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>T10-emacs-lisp-idioms</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-07-28
</div>
<div id="content" class="content">
<header>
<h1 class="title">T10-emacs-lisp-idioms</h1>
<p class="subtitle" role="doc-subtitle">docs</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3bf72a9">Summary</a></li>
<li><a href="#org0bcb013">Ref</a></li>
<li><a href="#org6baa8ea">Idioms</a>
<ul>
<li><a href="#org9d407b3">#001 Print Hello World</a></li>
<li><a href="#org0e8666f">#002 Print hello 10 times</a></li>
<li><a href="#orgf9558f6">#003 Create a procedure</a></li>
<li><a href="#orgdf830fa">#004 Create a Function</a></li>
<li><a href="#org0be3dd5">#005 Create a 2D Point data structure</a></li>
<li><a href="#org7adf4cc">#006 Iterate Over List Values</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org3bf72a9" class="outline-2">
<h2 id="org3bf72a9">Summary</h2>
<div class="outline-text-2" id="text-org3bf72a9">
<p>
I will take time for self-reflection and listen to my inner voice.
</p>
</div>
</div>

<div id="outline-container-org0bcb013" class="outline-2">
<h2 id="org0bcb013">Ref</h2>
<div class="outline-text-2" id="text-org0bcb013">
<ul class="org-ul">
<li><a href="https://programming-idioms.org/coverage">2024-07-29 programming-idioms.org</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/">2024-07-29 Top (GNU Emacs Lisp Reference Manual)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6baa8ea" class="outline-2">
<h2 id="org6baa8ea">Idioms</h2>
<div class="outline-text-2" id="text-org6baa8ea">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>

<div id="outline-container-org9d407b3" class="outline-3">
<h3 id="org9d407b3">#001 Print Hello World</h3>
<div class="outline-text-3" id="text-org9d407b3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(print "Hello, World!")
</pre>
</div>

<pre class="example" id="org39c3ad0">
"Hello, World!"
</pre>
</div>
</div>

<div id="outline-container-org0e8666f" class="outline-3">
<h3 id="org0e8666f">#002 Print hello 10 times</h3>
<div class="outline-text-3" id="text-org0e8666f">
<ul class="org-ul">
<li>`princ`: Outputs a string or character without additional formatting.</li>
<li>`message`: Prints a message to the minibuffer.</li>
<li>`insert`: Inserts text into the current buffer.</li>
<li>`print`: Outputs a Lisp object with additional formatting and a newline.</li>
<li>`prin1`: Outputs a Lisp object without additional formatting.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(dotimes (i 10)
  (princ "Hello\n"))
</pre>
</div>

<pre class="example" id="org9f96f17">
Hello
Hello
Hello
Hello
Hello
Hello
Hello
Hello
Hello
Hello
</pre>
</div>
</div>

<div id="outline-container-orgf9558f6" class="outline-3">
<h3 id="orgf9558f6">#003 Create a procedure</h3>
<div class="outline-text-3" id="text-orgf9558f6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun show (message)
  "Display a message in the echo area."
  (message "Hello: %s" message))

(show "again!")
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf830fa" class="outline-3">
<h3 id="orgdf830fa">#004 Create a Function</h3>
<div class="outline-text-3" id="text-orgdf830fa">
<p>
Functions in Emacs Lisp are defined using `defun`. The function `square` here takes a parameter `x` and returns its square by multiplying `x` by itself. Emacs Lisp automatically returns the value of the last evaluated expression. Functions are used for modularity and reuse of code. The provided function is a common example of mathematical operations often implemented in scripts.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun square (x)
  "Return the square of a number."
  (* x x))

(setq a 16)
(print (format "Square of %d is %d" a (square a)))
</pre>
</div>

<pre class="example" id="org776a725">
"Square of 16 is 256"
</pre>
</div>
</div>

<div id="outline-container-org0be3dd5" class="outline-3">
<h3 id="org0be3dd5">#005 Create a 2D Point data structure</h3>
<div class="outline-text-3" id="text-org0be3dd5">
<p>
In Emacs Lisp, a 2D point structure can be represented using various methods. One common approach is to use a list or vector to store the x and y coordinates. This example shows a simple implementation using a list and how to create a point and access its coordinates.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun make-point (x y)
  "Create a point with coordinates x and y."
  (list x y))

(defun point-x (point)
  "Get the x coordinate of POINT."
  (car point))

(defun point-y (point)
  "Get the y coordinate of POINT."
  (cadr point))

(let ((p (make-point 3.0 4.0)))
  (print (format "Point: (%f, %f)" (point-x p) (point-y p))))
</pre>
</div>

<pre class="example" id="org3b41612">
"Point: (3.000000, 4.000000)"
</pre>
</div>
</div>

<div id="outline-container-org7adf4cc" class="outline-3">
<h3 id="org7adf4cc">#006 Iterate Over List Values</h3>
<div class="outline-text-3" id="text-org7adf4cc">
<p>
In Emacs Lisp, iterating over list values can be achieved using several methods, such as `dolist`, `mapcar`, and `while` loops. This example demonstrates how to use `dolist` to iterate over a list and print each value.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq items '(1 2 3 4 5))

(dolist (x items)
  (princ (format "Item: %d\n" x)))
</pre>
</div>

<pre class="example" id="org215ffcd">
Item: 1
Item: 2
Item: 3
Item: 4
Item: 5
</pre>

<p>
Other methods include `mapcar`, which applies a function to each element of a list and returns a new list with the results. For side effects only, use `mapc` instead. The `while` loop provides a more manual approach, giving full control over iteration conditions and index management.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
